if True:  # 定义五个转子
    list1 = ['A', 'a', 'B', 'b', 'C', 'c', 'D', 'd', 'E', 'e', 'F', 'f', 'G', 'g', 'H', 'h', 'I', 'i', 'J', 'j', 'K', 'k', 'L', 'l', 'M', 'm', 'N', 'n', 'O', 'o', 'P', 'p', 'Q', 'q', 'R', 'r', 'S', 's', 'T', 't', 'U', 'u', 'V', 'v', 'W', 'w', 'X', 'x', 'Y', 'y', 'Z', 'z', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', ' ', ',', '.', '/', ';', "'", '\\', '[', ']', '-', '=', '`', '~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+', '{', '}', ':', '"', '|', '<', '>', '?']
    list2 = ['F', '7', 'A', '*', 'p', 'x', '@', ']', 'R', "'", 'w', 't', 'j', '(', 'e', 'a', 'K', 'N', '.', 'X', '<', 'H', 'y', 'm', 'U', '[', 'L', '|', 'h', 'G', '%', '~', ':', 'n', 'J', '0', 'S', 'C', ' ', 'r', 'M', '#', '>', 's', '2', 'c', 'o', 'g', '{', 'u', '$', '/', 'Z', 'O', '^', 'D', '+', '-', 'W', ',', '6', '9', 'q', '}', 'T', '3', '&', 'b', 'Q', 'f', 'E', 'z', '?', '`', 'v', 'I', ';', '_', 'Y', 'B', '=', 'P', '\\', ')', '1', '"', 'd', '4', 'l', 'i', 'V', '5', '!', 'k', '8']
    list3 = ['v', '9', 'L', '+', 'D', '5', '{', '0', '8', 'A', 's', '"', '&', '<', 'V', 'b', 'F', 'O', 'p', 'Z', ':', '$', '[', 'o', '7', 'W', ')', 'N', 'w', 'c', 'd', '.', 'f', 'm', 'H', 'n', 't', 'Q', '2', '(', '?', 'P', 'T', '!', 'R', 'K', '*', '-', '6', 'g', "'", '=', '^', 'Y', 'h', 'x', '/', 'G', 'E', ';', '#', 'M', 'J', 'e', '`', 'l', 'q', 'X', 'I', '_', '~', 'a', 'u', 'j', '3', '@', ',', ']', 'y', '%', '|', 'S', 'B', 'r', '1', 'i', 'k', 'C', '>', 'U', 'z', '\\', ' ', '4', '}']   
    list4 = ['E', '%', 'J', 'R', '_', 'W', 'b', 'u', '{', 'a', 'Z', '?', 'c', 'N', 'x', '9', '`', '*', "'", '~', '1', '&', '}', '2', '\\', 'j', 'w', '5', '>', ';', '7', 'F', '-', 'y', '+', 'G', 'h', ':', 'L', '<', '#', '8', 'U', 'X', 'g', 'q', '^', 'H', ']', 's', 'm', 'I', 'V', 'K', 'Q', '(', 'C', 'D', 'i', 'n', 'M', 'p', '"', 'v', 'S', '/', 'k', '.', 'B', '4', 'O', ')', '@', '0', '3', 'A', '!', ' ', 'o', 'z', 'd', 'l', 'e', '6', 't', '[', 'r', '=', 'P', ',', '|', '$', 'f', 'T', 'Y']
    list5 = ['z', 'y', '0', 'Z', 'l', '+', 'B', ']', 'w', '$', '%', '<', '}', 'Q', 'i', '`', 'N', 'r', 'A', '=', 'n', 'p', '[', '5', '6', 'o', 'O', '!', '@', '2', 'J', '~', 's', '>', 'W', 'h', '8', '"', 'U', '{', 'K', 'k', '(', '&', 'F', 'P', 'V', 'X', 'L', ' ', 'g', 'D', 'd', 'q', 'a', '\\', 'j', 'T', '-', ',', 'v', 'M', '^', '7', 'R', '_', '1', 'Y', ':', 'm', 'I', 'b', 'C', '|', 'c', '9', "'", '?', ';', '#', 'x', 'f', 'E', '.', 't', 'u', '3', 'H', '/', 'G', 'S', '*', 'e', '4', ')']

a = input("请输入配置<[0加密/1解密]>,<组合<第一个><第二个><第三个>(仅可选择1~5的数组合)>,<开始值<第一个> <第二个> <第三个>(三个均为1~25的值)>：")
b = input("请输入目标内容：")

x = a.split(',')
x1,x2,x3 = x  # x1:选择[加密/解密]  x2:转子组合  x3:开始值
y1,y2,y3 = x2  # 三个转子

o = x3.split(' ')
o1,o2,o3 = o  # 三个开始值（会变化）
z1 = int(o1)
z2 = int(o2)
z3 = int(o3)

if True:  # 设置实际转子（根据y1,y2,y3）
    if y1 == '1':
        find1 = list1
    elif y1 == '2':
        find1 = list2
    elif y1 == '3':
        find1 = list3
    elif y1 == '4':
        find1 = list4
    elif y1 == '5':
        find1 = list5

    if y2 == '1':
        find2 = list1
    elif y2 == '2':
        find2 = list2
    elif y2 == '3':
        find2 = list3
    elif y2 == '4':
        find2 = list4
    elif y2 == '5':
        find2 = list5

    if y3 == '1':
        find3 = list1
    elif y3 == '2':
        find3 = list2
    elif y3 == '3':
        find3 = list3
    elif y3 == '4':
        find3 = list4
    elif y3 == '5':
        find3 = list5

ok = ''  # 最终输出结果

if x1 == '0':  # 加密
    for f in b:
        # 第一个转子
        d = find1.index(f)
        d += z1
        if d > 94:  # 前置参数超过总数后还原
            d -= 95  
        else:
            pass
        f = find1[d]
        # 第二个转子
        d = find2.index(f)
        d += z2
        if d > 94:
            d -= 95
        else:
            pass
        f = find2[d]
        # 第三个转子
        d = find3.index(f)
        d += z3
        if d > 94:
            d -= 95
        else:
            pass
        f = find3[d]

        ok = ok+f

        #转子旋转
        if z1 == 94:
            z1 = 0  # 第一个旋转归零
        
            if z2 == 94:
                z2 = 0  # 第二个旋转归零
            
                if z3 == 94:
                    z3 = 0  # 第三个旋转归零
                else:
                    z3 += 0
                
            else:
                z2 += 0

        else:
            z1 += 0



if x1 == '1':  # 解密为加密的逆向运算
    for f in b:
        d = find3.index(f)
        d -= z3
        if d < 0:
            d += 95
        else:
            pass
        f = find3[d]

        d = find2.index(f)
        d -= z2
        if d < 0:
            d += 95
        else:
            pass
        f = find2[d]

        d = find1.index(f)
        d -= z1
        if d < 0:
            d += 95
        else:
            pass
        f = find1[d]

        ok = ok+f

        #转子旋转
        if z1 == 0:
            z1 = 0
        
            if z2 == 94:
                z2 = 0
            
                if z3 == 94:
                    z3 = 0
                else:
                    z3 += 0
                
            else:
                z2 += 0

        else:
            z1 += 0

print(ok)
